#include <iostream>


int main()
{
	std::cout << "hello, cpp" << std::endl;
}


// g++ 소스이름.cpp -std=c++20
// cl  소스이름.cpp /std:c++latest
// 강석민 강사( smkang @ codenuri.co.kr )

// github.com/codenuri/cppconcurrent
// 
// => DAY1.zip 있습니다.

// 실습환경 : visual studio 2017이상(2019 이상 권장)
// => g++10.x 이상

// 주요내용 : 멀티 스레드(병렬 프로그래밍) 관련
//           C++이 지원하는 다양한 클래스 사용법..

// 1. DAY1.zip 압축 풀러서 VS 에서 열어 보세요
// 
// 2. 버전 설정해야 합니다.
//    => 프로젝트 메뉴 선택후 속성 메뉴 선택
//    => 플랫폼 도구 집합, Windows SDK 버전 설정

// 3. 빌드 방법 : Ctrl + F5 로 빌드 확인

// 4. 소스 파일을 빌드에 포함/제외하는 방법

// 5. C++ 버전 지정하는 방법
// 
// g++ 소스이름.cpp -std=c++20
// VS 사용 : 프로젝트 메뉴, 속성 메뉴

// 6. 최신 버전 g++ 구하는 법
// => 구글에서 "github mingw11" 검색
// => 1번째 링크
// => 다운 받아서 압축 푼후에 "PATH" 환경변수 등록후
//    사용하면 됩니다.

// 7. 수업 시간 
// 오전 : 9:00 ~ 11:50
// 점심 : 11:50 ~ 13:00
// 오후 : 13:00 ~ 16:50

// 45 ~ 50 분 수업후 10~15분 휴식
